Documents/Рейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рейс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОперацииРейсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку25</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументПланированияДоставки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>В базовых ЕИ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформацияПоДоставке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозкиОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяТочкаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОперацииРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииРейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Рейс/Forms/ФормаСодержимого/Ext/Form/Module.bsl
// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; // см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Параметры.ТолькоПросмотр;
	
	Получатель = Параметры.Получатель;
	ТочкаДоставки = Параметры.ТочкаДоставки;
	ЗонаДоставки = Параметры.ЗонаДоставки;
	КлючСвязи = Параметры.КлючСвязи;
	Склад = Параметры.Склад;
	Организация = Параметры.Организация;
	СпособДоставки = Параметры.СпособДоставки;
	Перевозчик = Параметры.Перевозчик;
	ДатаВыезда = Параметры.ДатаВыезда;
	РейсПроведен = Параметры.РейсПроведен;
	РейсСсылка = Параметры.РейсСсылка;
	РейсМодифицирован = Параметры.РейсМодифицирован;
	Операция = Параметры.Операция;
	СтатусРейса = Параметры.Статус;
	
	НастроитьДоступностьПолейПоСтатусу();
	
	ТаблицаСодержимое = ПолучитьИзВременногоХранилища(Параметры.АдресСодержимое); // ТаблицаЗначений
	ДоставляемыеТовары.Загрузить(ТаблицаСодержимое);
	
	ДополнитьКолонкиДоставляемыхТоваров(ТаблицаСодержимое);
	ОбновитьНумерациюТоваров(ДоставляемыеТовары);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	СтруктураДействий.Вставить(
		"ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	
	СтруктураДействий.Вставить(
		"ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	
	СтруктураДействий.Вставить(
		"ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	
	СтруктураДействий.Вставить(
		"ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(ДоставляемыеТовары, СтруктураДействий);
	
	Для Каждого СтрокаТоваров Из ДоставляемыеТовары Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров);
		
	КонецЦикла;
	
	РаботаСТабличнымиЧастями.ИнициализироватьКэшСтрок(Элементы.ДоставляемыеТовары);
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		Элементы.ДоставляемыеТоварыДоставитьДоПеревозчика.Видимость = Ложь;
		Элементы.ДоставляемыеТоварыИзменитьПеревозчика.Видимость = Ложь;
		Элементы.ДоставляемыеТоварыДоставитьНашимиСилами.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		
	Иначе
		
		ПеренестиСодержимоеВДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Номенклатура"
	 ИЛИ ИмяСобытия = "Запись_УпаковкиНоменклатуры" Тогда
		
		ПересчитатьСтрокиТоваров(ИмяСобытия, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура, Произвольный -
//  ИсточникВыбора - ФормаКлиентскогоПриложения -
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументДоставки.Форма.ФормаПодбора" Тогда
		
		Модифицированность = Истина;
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоставляемыеТовары

&НаКлиенте
Процедура ДоставляемыеТоварыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьДоступностьЭлементов", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ЗаполнитьВесНеттоЕдиницы(ТекущаяСтрока);
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ЗаполнитьВесНеттоЕдиницы(ТекущаяСтрока);
	ПересчитатьВесОбъемВОбщихЕдиницах(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыПередУдалением(Элемент, Отказ)
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.ДоставляемыеТовары, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.ДоставляемыеТовары, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ПересчитатьИтогиПоДокументам", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыОтмененоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Отменено Тогда
		ТекущаяСтрока.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыДоставки.ПустаяСсылка");
	КонецЕсли;
	
	ОбновитьДоступностьОтменыСтроки(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыПослеУдаления(Элемент)
	
	ОбновитьНумерациюТоваров(ДоставляемыеТовары);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставляемыеТоварыОсобыеУсловияПеревозкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	ОбновитьДоступностьОсобыхУсловийПеревозки(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДокументы

&НаКлиенте
Процедура ТаблицаДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекстВопроса = НСтр("ru = 'Все товары по выбранному распоряжению и документу планирования будут удалены.
						|Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаДокументыПередУдалениемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиСодержимоеВДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДанные(Команда)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Если РейсМодифицирован Тогда
		
		Если РейсПроведен Тогда
			ТекстПредупреждения = НСтр("ru = 'Документ был изменен. Для открытия формы подбора необходимо провести рейс'");
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Документ был изменен. Для открытия формы подбора необходимо записать рейс'");
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	Отказ = Ложь;
	ПроверитьЗаполнениеПередПодбором(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставитьДоПеревозчика(Команда)
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выберите строку товаров'");
		ПредупреждениеАсинх(ТекстПредупреждения);
		
	Иначе
		
		ЗаголовокФормы = НСтр("ru = 'Выбор перевозчика'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбораПеревозчика", ЭтотОбъект);
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("ЗаголовокФормы", ЗаголовокФормы);
		ПараметрыВыбора.Вставить("Получатель", Получатель);
		ПараметрыВыбора.Вставить("ТочкаПолучателя", ТочкаДоставки);
		ПараметрыВыбора.Вставить("ЗонаПолучателя", ЗонаДоставки);
		
		ОткрытьФорму("Документ.Рейс.Форма.ФормаВыбораПунктаДоставки", ПараметрыВыбора, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПеревозчика(Команда)
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выберите строку товаров'");
		ПредупреждениеАсинх(ТекстПредупреждения);
		
	Иначе
		
		ЗаголовокФормы = НСтр("ru = 'Смена перевозчика'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеИзмененияПеревозчика", ЭтотОбъект);
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("ЗаголовокФормы", ЗаголовокФормы);
		ПараметрыВыбора.Вставить("Перевозчик", Получатель);
		ПараметрыВыбора.Вставить("ТочкаДоставки", ТочкаДоставки);
		ПараметрыВыбора.Вставить("ЗонаДоставки", ЗонаДоставки);
		ПараметрыВыбора.Вставить("ВыбратьТолькоПеревозчика", Истина);
		ПараметрыВыбора.Вставить("Получатель", ТекущиеДанные.КонечныйПункт);
		
		ОткрытьФорму("Документ.Рейс.Форма.ФормаВыбораПунктаДоставки", ПараметрыВыбора, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставитьНашимиСилами(Команда)
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выберите строку товаров'");
		ПредупреждениеАсинх(ТекстПредупреждения);
		
	Иначе
		
		ЗаголовокФормы = НСтр("ru = 'Пункт получателя'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеДоставкаНашимиСилами", ЭтотОбъект);
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("ЗаголовокФормы", ЗаголовокФормы);
		ПараметрыВыбора.Вставить("Получатель", ТекущиеДанные.КонечныйПункт);
		ПараметрыВыбора.Вставить("ТочкаПолучателя", ТекущиеДанные.КонечнаяТочкаДоставкиПлан );
		ПараметрыВыбора.Вставить("ЗонаПолучателя", ТекущиеДанные.КонечнаяЗонаДоставкиПлан);
		ПараметрыВыбора.Вставить("ВыбратьТолькоПолучателя", Истина);
		
		ОткрытьФорму("Документ.Рейс.Форма.ФормаВыбораПунктаДоставки", ПараметрыВыбора, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеренестиСодержимоеВДокумент()
	
	Результат = Новый Структура();
	Результат.Вставить("Модифицированность", Модифицированность);
	Результат.Вставить("КлючСвязи", КлючСвязи);
	
	Если Модифицированность Тогда
		
		Адреса = АдресаДоставляемыхТоваров();
		АдресДоставляемыеТовары = Адреса.АдресДоставляемыеТовары;
		АдресДоставляемыеТоварыИзменения = Адреса.АдресДоставляемыеТоварыИзменения;
		
	Иначе
		
		АдресДоставляемыеТовары = "";
		АдресДоставляемыеТоварыИзменения = "";
		
	КонецЕсли;
	
	Результат.Вставить("АдресДоставляемыеТовары", АдресДоставляемыеТовары);
	Результат.Вставить("АдресДоставляемыеТоварыИзменения", АдресДоставляемыеТоварыИзменения);
	
	Модифицированность = Ложь;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Функция АдресаДоставляемыхТоваров()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресДоставляемыеТовары", "");
	Результат.Вставить("АдресДоставляемыеТоварыИзменения", "");
	
	ТаблицаДоставляемыеТовары = ДоставляемыеТовары.Выгрузить();
	Результат.АдресДоставляемыеТовары = ПоместитьВоВременноеХранилище(
		ТаблицаДоставляемыеТовары,
		УникальныйИдентификатор);
	
	ТаблицаДоставляемыеТоварыИзменения = ДоставляемыеТоварыИзменения.Выгрузить();
	Результат.АдресДоставляемыеТоварыИзменения = ПоместитьВоВременноеХранилище(
		ТаблицаДоставляемыеТоварыИзменения,
		УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьИтогиПоДокументам()
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиПоДокументамНаСервере()
	
	КолонкиГруппировки = КолонкиГруппировкиПоДокументам();
	КолонкиГруппировкиСтрокой = СтрСоединить(КолонкиГруппировки, ",");
	
	КолонкиСуммирования = Новый Массив; // Массив Из Строка
	КолонкиСуммирования.Добавить("ВесНетто");
	КолонкиСуммирования.Добавить("Вес");
	КолонкиСуммирования.Добавить("Объем");
	КолонкиСуммированияСтрокой = СтрСоединить(КолонкиСуммирования, ",");
	
	ВсеКолонкиДокументов = Новый Массив; // Массив Из Строка
	ВсеКолонкиДокументов.Добавить("Отменено");
	ВсеКолонкиДокументов.Добавить("ПричинаОтмены");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеКолонкиДокументов, КолонкиГруппировки);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеКолонкиДокументов, КолонкиСуммирования);
	ВсеКолонкиДокументовСтрокой = СтрСоединить(ВсеКолонкиДокументов, ",");
	
	ПромежуточнаяТаблица = ДоставляемыеТовары.Выгрузить(, ВсеКолонкиДокументовСтрокой);
	
	УдаляемыеСтроки = Новый Массив; // Массив Из СтрокаТаблицыЗначений
	Для Каждого СтрокаТаблицы Из ПромежуточнаяТаблица Цикл
		
		Если СтрокаТаблицы.Отменено Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ПромежуточнаяТаблица, УдаляемыеСтроки);
	
	ПромежуточнаяТаблица.Свернуть(КолонкиГруппировкиСтрокой, КолонкиСуммированияСтрокой);
	
	ТаблицаДокументы.Загрузить(ПромежуточнаяТаблица);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНеактуальныеСтрокиТоваров()
	
	КолонкиГруппировки = КолонкиГруппировкиПоДокументам();
	КолонкиГруппировкиСтрокой = СтрСоединить(КолонкиГруппировки, ",");
	КлючиТоваров = ДоставляемыеТовары.Выгрузить(, КолонкиГруппировкиСтрокой);
	КлючиТоваров.Свернуть(КолонкиГруппировкиСтрокой);
	ОтборСтрок = Новый Структура(КолонкиГруппировкиСтрокой);
	
	Для Каждого СтрокаКлючейТоваров Из КлючиТоваров Цикл
		
		ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаКлючейТоваров);
		СтрокиДокументов = ТаблицаДокументы.НайтиСтроки(ОтборСтрок);
		Если СтрокиДокументов.Количество() = 0 Тогда
			
			СтрокиТоваров = ДоставляемыеТовары.НайтиСтроки(ОтборСтрок);
			ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ДоставляемыеТовары, СтрокиТоваров);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КолонкиГруппировкиПоДокументам()
	
	КолонкиГруппировки = Новый Массив; // Массив Из Строка
	КолонкиГруппировки.Добавить("Распоряжение");
	КолонкиГруппировки.Добавить("ДокументПланирования");
	
	Возврат КолонкиГруппировки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров)
	
	// объем в кубических метрах
	Если СтрокаТоваров.МернаяЕдиница Тогда
		СтрокаТоваров.Объем = СтрокаТоваров.Количество * СтрокаТоваров.ОбъемЕдиницы;
	Иначе
		СтрокаТоваров.Объем = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.ОбъемУпаковки;
	КонецЕсли;
	
	// вес нетто в кг
	СтрокаТоваров.ВесНетто = СтрокаТоваров.Количество * СтрокаТоваров.ВесНеттоЕдиницы;
	
	// вес брутто в кг
	Если СтрокаТоваров.МернаяЕдиница Тогда
		СтрокаТоваров.Вес = СтрокаТоваров.ВесНетто;
	Иначе
		СтрокаТоваров.Вес = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.ВесУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоэффициентыВесОбъем(Знач Номенклатура, Знач Упаковка)
	
	ПустаяУпаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	Результат = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(ПустаяУпаковка, Номенклатура,, Ложь);
	МернаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(Упаковка);
	Результат.Вставить("МернаяЕдиница", МернаяЕдиница);
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Результат - КодВозвратаДиалога
//  Параметры - Неопределено
//
&НаКлиенте
Процедура ТаблицаДокументыПередУдалениемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ИдентификаторСтроки = Элементы.ТаблицаДокументы.ТекущаяСтрока; // Число
		ТекущаяСтрока = ТаблицаДокументы.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТаблицаДокументы.Удалить(ТекущаяСтрока);
		Модифицированность = Истина;
		
		УдалитьНеактуальныеСтрокиТоваров();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров)
	
	ДанныеНоменклатуры = КоэффициентыВесОбъем(СтрокаТоваров.Номенклатура, СтрокаТоваров.Упаковка);
	СтрокаТоваров.ВесНеттоЕдиницы = ДанныеНоменклатуры.ВесНетто; // Число
	СтрокаТоваров.ОбъемЕдиницы = ДанныеНоменклатуры.Объем; // Число
	СтрокаТоваров.МернаяЕдиница = ДанныеНоменклатуры.МернаяЕдиница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиТоваров(ИмяСобытия, Источник)
	
	ОтборСтрок = Новый Структура;
	
	Если ИмяСобытия = "Запись_Номенклатура" Тогда
		
		ОтборСтрок.Вставить("Номенклатура", Источник);
		
	ИначеЕсли ИмяСобытия = "Запись_УпаковкиНоменклатуры" Тогда
		
		ОтборСтрок.Вставить("Упаковка", Источник);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	СтрокиДляПересчета = ДоставляемыеТовары.НайтиСтроки(ОтборСтрок);
	Если СтрокиДляПересчета.Количество() > 0 Тогда
		
		ПересчитатьСтрокиТоваровСервер(ОтборСтрок);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокиТоваровСервер(Знач ОтборСтрок)
	
	СтрокиДляПересчета = ДоставляемыеТовары.НайтиСтроки(ОтборСтрок);
	
	СтруктураДействий = Новый Структура;
	
	Если ОтборСтрок.Свойство("Номенклатура") Тогда
		
		ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Неопределено);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Неопределено);
		
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(СтрокиДляПересчета, СтруктураДействий, ДоставляемыеТовары);
	
	Для Каждого СтрокаТоваров Из СтрокиДляПересчета Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаТоваров);
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНумерациюТоваров(ДоставляемыеТовары)
	
	КоличествоСтрок = ДоставляемыеТовары.Количество() - 1;
	Для ИндексСтроки = 0 По КоличествоСтрок Цикл
		ДоставляемыеТовары[ИндексСтроки].НомерСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередПодбором(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Организация",, Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Склад"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Склад",, Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпособДоставки) Тогда
		
		ТекстОшибки = НСтр("ru = 'Поле ""Способ доставки"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "СпособДоставки",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборДанных()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("СпособДоставки", СпособДоставки);
	ПараметрыФормы.Вставить("Перевозчик", Перевозчик);
	ПараметрыФормы.Вставить("ДатаОтгрузки", ДатаВыезда);
	ПараметрыФормы.Вставить("УчитыватьКоличествоВДокументе", НЕ РейсПроведен);
	ПараметрыФормы.Вставить("ДокументДоставки", РейсСсылка);
	ПараметрыФормы.Вставить("Получатель", Получатель);
	ПараметрыФормы.Вставить("ТочкаДоставки", ТочкаДоставки);
	ПараметрыФормы.Вставить("ЗонаДоставки", ЗонаДоставки);
	
	ФиксированныеПоляОтбора = Новый СписокЗначений(); // СписокЗначений Из Строка
	ФиксированныеПоляОтбора.Добавить("Получатель");
	ПараметрыФормы.Вставить("ФиксированныеПоляОтбора", ФиксированныеПоляОтбора);
	
	ПараметрыФормы.Вставить("ТочкаДоставкиФиксированная", ТочкаДоставки);
	ПараметрыФормы.Вставить("ЗонаДоставкиФиксированная", ЗонаДоставки);
	ПараметрыФормы.Вставить("ЗафиксироватьПараметрыДоставки", Истина);
	
	Если Операция = ПредопределенноеЗначение("Перечисление.ОперацииРейсов.Разгрузка") Тогда
		ПараметрыФормы.Вставить("ТипДоставки", ПредопределенноеЗначение("Перечисление.ТипыДоставки.Исходящая"));
	Иначе
		ПараметрыФормы.Вставить("ТипДоставки", ПредопределенноеЗначение("Перечисление.ТипыДоставки.Входящая"));
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументДоставки.Форма.ФормаПодбора",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура:
//   * АдресПодобранныхТоваров - Строка
//
&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(Знач ВыбранноеЗначение)
	
	ПодобранныеТовары = ПодобранныеТовары(ВыбранноеЗначение);
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	НовыеСтрокиСодержимого = Новый Массив; // Массив Из ДанныеФормыЭлементКоллекции
	ИзмененныеСтрокиСодержимого = Новый Массив; // Массив Из ДанныеФормыЭлементКоллекции
	
	ОтборСодержимое = Новый Структура;
	ОтборСодержимое.Вставить("Распоряжение", Неопределено);
	ОтборСодержимое.Вставить("ДокументПланирования", Неопределено);
	ОтборСодержимое.Вставить("КодСтроки", 0);
	ОтборСодержимое.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ОтборСодержимое.Вставить("Отменено", Ложь);
	
	СтруктураДействияПересчитатьКоличествоУпаковок = Новый Структура("ПересчитатьКоличествоУпаковок", Неопределено);
	
	Для Каждого СтрокаПодобрано Из ПодобранныеТовары Цикл
		
		ЗаполнитьЗначенияСвойств(ОтборСодержимое, СтрокаПодобрано);
		СтрокиСодержимогоПоТовару = ДоставляемыеТовары.НайтиСтроки(ОтборСодержимое);
		Если СтрокиСодержимогоПоТовару.Количество() > 0 Тогда
			
			ПодходящаяСтрокаСодержимого = СтрокиСодержимогоПоТовару[0];
			ПодходящаяСтрокаСодержимого.Количество = ПодходящаяСтрокаСодержимого.Количество + СтрокаПодобрано.Количество;
			ИзмененныеСтрокиСодержимого.Добавить(ПодходящаяСтрокаСодержимого);
			
		Иначе
			
			ПодходящаяСтрокаСодержимого = ДоставляемыеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(ПодходящаяСтрокаСодержимого, СтрокаПодобрано);
			ПодходящаяСтрокаСодержимого.КлючСвязи = КлючСвязи;
			НовыеСтрокиСодержимого.Добавить(ПодходящаяСтрокаСодержимого);
			
		КонецЕсли;
		
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПересчитатьКоличествоУпаковокВСтрокеТЧ(
			ПодходящаяСтрокаСодержимого, СтруктураДействияПересчитатьКоличествоУпаковок, КэшированныеЗначения);
		
	КонецЦикла;
	
	ОбновитьНумерациюТоваров(ДоставляемыеТовары);
	
	СтруктураДействий = Новый Структура;
	ЗаполнитьПризнакТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", ЗаполнитьПризнакТипНоменклатуры);
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Неопределено);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Неопределено);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ВесУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",
		Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса", Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",
		Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема", Неопределено));
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Неопределено);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		НовыеСтрокиСодержимого, СтруктураДействий, ДоставляемыеТовары, КэшированныеЗначения);
	
	Для Каждого СтрокаСодержимого Из НовыеСтрокиСодержимого Цикл
		
		ЗаполнитьВесНеттоЕдиницы(СтрокаСодержимого);
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаСодержимого);
		
	КонецЦикла;
	
	Для Каждого СтрокаСодержимого Из ИзмененныеСтрокиСодержимого Цикл
		
		ПересчитатьВесОбъемВОбщихЕдиницах(СтрокаСодержимого);
		
	КонецЦикла;
	
	Документы.Рейс.ЗаполнитьДополнительныеПараметрыСодержимого(ИзмененныеСтрокиСодержимого);
	Документы.Рейс.ЗаполнитьДополнительныеПараметрыСодержимого(НовыеСтрокиСодержимого);
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
КонецПроцедуры

// Параметры:
//  ВыбранноеЗначение - Структура - Выбранное значение:
// * АдресПодобранныхТоваров - Строка - 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица подобранных товаров:
//  * ДоставкаДо - СправочникСсылка.Партнеры
//  * ТочкаДоставки - СправочникСсылка.ТочкиДоставки
//  * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//  * Количество - Число
//  * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//
&НаСервере
Функция ПодобранныеТовары(ВыбранноеЗначение)
	
	ПодобранныеТовары = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобранныхТоваров); // ТаблицаЗначений
	УдалитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобранныхТоваров);
	Возврат ПодобранныеТовары;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	
	ТекущаяСтрока = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	
	Если КомандыИзмененияПараметровДоставкиДоступны Тогда
		
		Если ТекущаяСтрока = Неопределено Тогда
			
			Элементы.ДоставляемыеТоварыДоставитьДоПеревозчика.Доступность = Ложь;
			Элементы.ДоставляемыеТоварыИзменитьПеревозчика.Доступность = Ложь;
			Элементы.ДоставляемыеТоварыДоставитьНашимиСилами.Доступность = Ложь;
			Элементы.ДоставляемыеТоварыОтменено.ТолькоПросмотр = Истина;
			
		ИначеЕсли Получатель <> ТекущаяСтрока.КонечныйПункт Тогда
			
			// Это доставка до перевозчика
			Элементы.ДоставляемыеТоварыДоставитьДоПеревозчика.Доступность = Ложь;
			Элементы.ДоставляемыеТоварыИзменитьПеревозчика.Доступность = Истина;
			Элементы.ДоставляемыеТоварыДоставитьНашимиСилами.Доступность = Истина;
			
		Иначе
			
			// Это доставка нашими силами
			Элементы.ДоставляемыеТоварыДоставитьДоПеревозчика.Доступность = Истина;
			Элементы.ДоставляемыеТоварыИзменитьПеревозчика.Доступность = Ложь;
			Элементы.ДоставляемыеТоварыДоставитьНашимиСилами.Доступность = Ложь;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ОбновитьДоступностьОтменыСтроки(ТекущаяСтрока);
		
	КонецЕсли;
	
	ОбновитьДоступностьОсобыхУсловийПеревозки(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьКолонкиДоставляемыхТоваров(ТаблицаСодержимое)
	
	КолонкиАнализа = "Распоряжение, ДокументПланирования, КодСтроки";
	ТаблицаДоставляемыеТовары = ТаблицаСодержимое.Скопировать(, КолонкиАнализа);
	ТаблицаДоставляемыеТовары.Свернуть(КолонкиАнализа);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВтДанныеСодержимое.Распоряжение КАК Распоряжение,
	|	ВтДанныеСодержимое.ДокументПланирования КАК ДокументПланирования,
	|	ВтДанныеСодержимое.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ВтДанныеСодержимое
	|ИЗ
	|	&ДанныеСодержимое КАК ВтДанныеСодержимое
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеСодержимое.Распоряжение КАК Распоряжение,
	|	ВтДанныеСодержимое.ДокументПланирования КАК ДокументПланирования,
	|	ВтДанныеСодержимое.КодСтроки КАК КодСтроки,
	|	ЕСТЬNULL(ДоставкаПлечо1.Получатель, НЕОПРЕДЕЛЕНО) КАК ПолучательПлечо1,
	|	ЕСТЬNULL(ДоставкаПлечо1.ТочкаПолучателя, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)) КАК ТочкаПолучателяПлечо1,
	|	ЕСТЬNULL(ДоставкаПлечо1.ЗонаПолучателя, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК ЗонаПолучателяПлечо1,
	|	ЕСТЬNULL(ДоставкаКонечноеПлечо.Получатель, НЕОПРЕДЕЛЕНО) КАК Получатель,
	|	ЕСТЬNULL(ДоставкаКонечноеПлечо.ТочкаПолучателя, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)) КАК ТочкаПолучателя,
	|	ЕСТЬNULL(ДоставкаКонечноеПлечо.ЗонаПолучателя, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК ЗонаПолучателя
	|ИЗ
	|	ВтДанныеСодержимое КАК ВтДанныеСодержимое
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДоставкаКонечноеПлечо
	|		ПО ВтДанныеСодержимое.Распоряжение = ДоставкаКонечноеПлечо.Распоряжение
	|			И ВтДанныеСодержимое.ДокументПланирования = ДоставкаКонечноеПлечо.ДокументПланирования
	|			И ВтДанныеСодержимое.КодСтроки = ДоставкаКонечноеПлечо.КодСтроки
	|			И (ДоставкаКонечноеПлечо.ЭтоКонечноеПлечо)
	|			И (ДоставкаКонечноеПлечо.УровеньОперации В (15, 20))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДоставкаПлечо1
	|		ПО ВтДанныеСодержимое.Распоряжение = ДоставкаПлечо1.Распоряжение
	|			И ВтДанныеСодержимое.ДокументПланирования = ДоставкаПлечо1.ДокументПланирования
	|			И ВтДанныеСодержимое.КодСтроки = ДоставкаПлечо1.КодСтроки
	|			И (ДоставкаПлечо1.Плечо = 1)
	|			И (ДоставкаПлечо1.УровеньОперации В (15, 20))";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДанныеСодержимое", ТаблицаДоставляемыеТовары);
	ДанныеДоставкиПоПлечам = Запрос.Выполнить().Выгрузить();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Распоряжение");
	СтруктураПоиска.Вставить("ДокументПланирования");
	СтруктураПоиска.Вставить("КодСтроки");
	
	Для каждого СтрокаТоваровДоставки Из ДоставляемыеТовары Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТоваровДоставки);
		СтрокиДанных = ДанныеДоставкиПоПлечам.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДанных.Количество() > 0 Тогда
			
			СтрокаДанных = СтрокиДанных[0];
			
			СтрокаТоваровДоставки.КонечныйПункт = СтрокаДанных.Получатель;
			СтрокаТоваровДоставки.КонечнаяТочкаДоставкиПлан = СтрокаДанных.ТочкаПолучателя;
			СтрокаТоваровДоставки.КонечнаяЗонаДоставкиПлан = СтрокаДанных.ЗонаПолучателя;
			
			// Сейчас в рейсах планируется только первое плечо доставки, поэтому сверяемся по нему
			Если Получатель <> СтрокаДанных.ПолучательПлечо1
				ИЛИ ТочкаДоставки <> СтрокаДанных.ТочкаПолучателяПлечо1
				ИЛИ ЗонаДоставки <> СтрокаДанных.ЗонаПолучателяПлечо1 Тогда
				
				СтрокаТоваровДоставки.ЕстьИзмененияИсходныхДанных = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//  * Перевозчик - СправочникСсылка.Партнеры
//  * ТочкаДоставки - СправочникСсылка.ТочкиДоставки
//  * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//  * Получатель - СправочникСсылка.Партнеры, СправочникСсылка.Склады -
//  * ТочкаПолучателя - СправочникСсылка.ТочкиДоставки
//  * ЗонаПолучателя - СправочникСсылка.ЗоныДоставки
//  ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Процедура ЗавершениеВыбораПеревозчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена
		ИЛИ Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыСтрокТоваров = Новый Массив; // Массив из Число
	ИдентификаторыСтрокТоваров.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
	
	ЗавершениеВыбораПеревозчикаСервер(Результат, ИдентификаторыСтрокТоваров);
	
	Модифицированность = Истина;
	
	ЗаголовокОповещения = НСтр("ru = 'Доставка до перевозчика'");
	ШаблонЗаголовкаОповещения = НСтр("ru = '%1, %2'");
	ТекстПояснения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаОповещения,
		Строка(Результат.Перевозчик),
		Строка(Результат.ТочкаДоставки));
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения,, ТекстПояснения);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеВыбораПеревозчикаСервер(Знач Результат, Знач ИдентификаторыСтрокТоваров)
	
	СтрокиКУдалению = Новый Массив; // Массив из ДанныеФормыЭлементКоллекции
	
	Для Каждого ИдентификаторСтрокиТовара Из ИдентификаторыСтрокТоваров Цикл
		
		СтрокаТовара = ДоставляемыеТовары.НайтиПоИдентификатору(ИдентификаторСтрокиТовара);
		
		СтрокаИзменений = ДоставляемыеТоварыИзменения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИзменений, СтрокаТовара);
		
		СтрокаИзменений.Перевозчик = Результат.Перевозчик;
		СтрокаИзменений.ТочкаДоставки = Результат.ТочкаДоставки;
		СтрокаИзменений.ЗонаДоставки = Результат.ЗонаДоставки;
		
		СтрокаИзменений.КонечныйПункт = Результат.Получатель;
		СтрокаИзменений.КонечнаяТочкаДоставки = Результат.ТочкаПолучателя;
		СтрокаИзменений.КонечнаяЗонаДоставки = Результат.ЗонаПолучателя;
		
		СтрокиКУдалению.Добавить(СтрокаТовара);
		
	КонецЦикла;
	
	ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ДоставляемыеТовары, СтрокиКУдалению);
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//  * Перевозчик - СправочникСсылка.Партнеры
//  * ТочкаДоставки - СправочникСсылка.ТочкиДоставки
//  * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//  ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Процедура ЗавершениеИзмененияПеревозчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена
		ИЛИ Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыСтрокТоваров = Новый Массив; // Массив из Число
	ИдентификаторыСтрокТоваров.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
	
	ЗавершениеИзмененияПеревозчикаСервер(Результат, ИдентификаторыСтрокТоваров);
	
	Модифицированность = Истина;
	
	ЗаголовокОповещения = НСтр("ru = 'Изменение перевозчика'");
	ШаблонЗаголовкаОповещения = НСтр("ru = '%1, %2'");
	ТекстПояснения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаОповещения,
		Строка(Результат.Перевозчик),
		Строка(Результат.ТочкаДоставки));
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения,, ТекстПояснения);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеИзмененияПеревозчикаСервер(Знач Результат, Знач ИдентификаторыСтрокТоваров)
	
	СтрокиКУдалению = Новый Массив; // Массив из ДанныеФормыЭлементКоллекции
	
	Для Каждого ИдентификаторСтрокиТовара Из ИдентификаторыСтрокТоваров Цикл
		
		СтрокаТовара = ДоставляемыеТовары.НайтиПоИдентификатору(ИдентификаторСтрокиТовара);
		
		СтрокаИзменений = ДоставляемыеТоварыИзменения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИзменений, СтрокаТовара);
		
		СтрокаИзменений.Перевозчик = Результат.Перевозчик;
		СтрокаИзменений.ТочкаДоставки = Результат.ТочкаДоставки;
		СтрокаИзменений.ЗонаДоставки = Результат.ЗонаДоставки;
		
		СтрокиКУдалению.Добавить(СтрокаТовара);
		
	КонецЦикла;
	
	ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ДоставляемыеТовары, СтрокиКУдалению);
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
КонецПроцедуры

// Параметры:
//  Результат - Структура:
//  * Получатель - СправочникСсылка.Партнеры, СправочникСсылка.Склады -
//  * ТочкаПолучателя - СправочникСсылка.ТочкиДоставки
//  * ЗонаПолучателя - СправочникСсылка.ЗоныДоставки
//  ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Процедура ЗавершениеДоставкаНашимиСилами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена
		ИЛИ Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДоставляемыеТовары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыСтрокТоваров = Новый Массив; // Массив из Число
	ИдентификаторыСтрокТоваров.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
	
	ЗавершениеДоставкаНашимиСиламиСервер(Результат, ИдентификаторыСтрокТоваров);
	
	Модифицированность = Истина;
	
	ЗаголовокОповещения = НСтр("ru = 'Доставка нашими силами'");
	ШаблонЗаголовкаОповещения = НСтр("ru = '%1, %2'");
	ТекстПояснения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаОповещения,
		Строка(Результат.ТочкаПолучателя),
		Строка(Результат.ЗонаПолучателя));
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения,, ТекстПояснения);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеДоставкаНашимиСиламиСервер(Знач Результат, Знач ИдентификаторыСтрокТоваров)
	
	СтрокиКУдалению = Новый Массив; // Массив из ДанныеФормыЭлементКоллекции
	
	Для Каждого ИдентификаторСтрокиТовара Из ИдентификаторыСтрокТоваров Цикл
		
		СтрокаТовара = ДоставляемыеТовары.НайтиПоИдентификатору(ИдентификаторСтрокиТовара);
		
		СтрокаИзменений = ДоставляемыеТоварыИзменения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИзменений, СтрокаТовара);
		
		СтрокаИзменений.КонечныйПункт = Результат.Получатель;
		СтрокаИзменений.КонечнаяТочкаДоставки = Результат.ТочкаПолучателя;
		СтрокаИзменений.КонечнаяЗонаДоставки = Результат.ЗонаПолучателя;
		
		СтрокиКУдалению.Добавить(СтрокаТовара);
		
	КонецЦикла;
	
	ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ДоставляемыеТовары, СтрокиКУдалению);
	
	ПересчитатьИтогиПоДокументамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьПолейПоСтатусу()
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	БлокируемыеПоля = Новый Массив; // Массив из Строка
	
	ЗапретитьИзменениеСоставаСтрок = Ложь;
	
	Если СтатусРейса = Перечисления.СтатусыРейсов.Сформирован
	 ИЛИ СтатусРейса = Перечисления.СтатусыРейсов.Отправлен Тогда
		
		ЗапретитьИзменениеСоставаСтрок = Истина;
		
	ИначеЕсли СтатусРейса = Перечисления.СтатусыРейсов.Завершен Тогда
		
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыВремяДоставки.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыГруппаИнформация.Имя);
		
		ЗапретитьИзменениеСоставаСтрок = Истина;
		
	ИначеЕсли СтатусРейса = Перечисления.СтатусыРейсов.Отменен Тогда
		
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыВремяДоставки.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыГруппаИнформация.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыОтменено.Имя);
		
	Иначе
		
		КомандыИзмененияПараметровДоставкиДоступны = Истина;
		
	КонецЕсли;
	
	Если НЕ КомандыИзмененияПараметровДоставкиДоступны Тогда
		
		БлокируемыеПоля.Добавить(Элементы.ДокументыПодобратьДанные.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыПодобратьДанные.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыДоставитьДоПеревозчика.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыИзменитьПеревозчика.Имя);
		БлокируемыеПоля.Добавить(Элементы.ДоставляемыеТоварыДоставитьНашимиСилами.Имя);
		
	КонецЕсли;
	
	Если ЗапретитьИзменениеСоставаСтрок Тогда
		
		Элементы.ТаблицаДокументы.ИзменятьСоставСтрок = Ложь;
		Элементы.ДоставляемыеТовары.ИзменятьСоставСтрок = Ложь;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, БлокируемыеПоля, "ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьОтменыСтроки(ДанныеСтроки)
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Элементы.ДоставляемыеТоварыПричинаОтмены.ТолькоПросмотр = НЕ ДанныеСтроки.Отменено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьОсобыхУсловийПеревозки(ДанныеСтроки)
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Элементы.ДоставляемыеТоварыОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ ДанныеСтроки.ОсобыеУсловияПеревозки;
		
	КонецЕсли;
	
КонецПроцедуры

#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановитьУсловноеОформлениеНезаполненныйВесУпаковки();
	УстановитьУсловноеОформлениеНезаполненныйОбъемУпаковки();
	УстановитьУсловноеОформлениеНезаполненныйВесНетто();
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, "ДоставляемыеТоварыХарактеристика", "ДоставляемыеТовары.ХарактеристикиИспользуются");
	
	УстановитьУсловноеОформлениеСерий();
	
	ПараметрыОформленияЕдиниц = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ПараметрыОформленияЕдиниц.ИмяПоляЕдиницаИзмерения = "ДоставляемыеТоварыНоменклатураЕдиницаИзмерения";
	ПараметрыОформленияЕдиниц.ПутьКПолюУпаковка = "ДоставляемыеТовары.Упаковка";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект, ПараметрыОформленияЕдиниц);
	
	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(
		УсловноеОформление,
		Элементы.ДоставляемыеТовары,
		Элементы.ДоставляемыеТоварыОтменено.Имя,
		Элементы.ДоставляемыеТоварыПричинаОтмены.Имя);
	
	УстановитьУсловноеОформлениеНезаполненныйВесОбъемПоДокументам();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСерий()
	
	СписокТиповДляСерий = Новый СписокЗначений; // СписокЗначений из ПеречислениеСсылка.ТипыНоменклатуры
	СписокТиповДляСерий.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокТиповДляСерий.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	
	ПутьКПолюСерии = "ДоставляемыеТовары.Серия";
	ПутьКПолюОтбораТипНоменклатуры = "ДоставляемыеТовары.ТипНоменклатуры";
	ИмяПоляФормыСерии = Элементы.ДоставляемыеТоварыСерия.Имя; // ПолеФормы
	
	// Для товаров
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормыСерии);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораТипНоменклатуры);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокТиповДляСерий;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для товаров>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Серия не указывается
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФормыСерии);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюСерии);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораТипНоменклатуры);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокТиповДляСерий;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серия не указывается>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйВесНетто()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоставляемыеТоварыВесНетто.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоставляемыеТовары.ВесНеттоЕдиницы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйОбъемУпаковки()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоставляемыеТоварыОбъем.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоставляемыеТовары.ОбъемУпаковки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйВесУпаковки()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоставляемыеТоварыВес.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоставляемыеТовары.ВесУпаковки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНезаполненныйВесОбъемПоДокументам()
	
	ТекстНеИспользуется = ДоставкаТоваровКлиентСервер.ТекстУсловногоОформленияНеИспользуетсяВесОбъем();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДокументыВес.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументы.Вес");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДокументыОбъем.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументы.Объем");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДокументыВесНетто.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДокументы.ВесНетто");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ТекстНеИспользуется);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
